### For Dataset please visit this link - [Data](https://github.com/Ashuk25/Courses/tree/main/Pandas/Dataset)

## Creating DataFrame & Series

        We have to import Pandas
        import pandas as pd

### For creating the DataFrame we have to follow below syntax.
    pd.DataFrame(
     {'Key':'Values'}
    )
    Key - Column Name
    Values - Row Entries
   
### Note:
    By default DataFrame is proving index in accending order when we create it. eg. 0,1,2,3,4,5....
    If we want to change the index, we need to write code in below format.
    pd.DataFrame(
    {'key':'Value'}, index=['A','B',...]
    )
    The index name depends on how many enteries we have in DataFrame.

### Example:

In [1]:
import pandas as pd

In [2]:
# Crearing DataFrame
dict1 = {
    "name":['Jon', 'Kevin', 'Oreo', 'Alex', 'Fake'],
    "mark":[80,78,75,84,82],
    "city":['Mumbai','Banglore','Malad','Dombivli','Ghansoli']
}

In [5]:
df = pd.DataFrame(dict1)

In [4]:
df.head() # Display only top 5 enteries in the table.

    name  mark      city
0    Jon    80    Mumbai
1  Kevin    78  Banglore
2   Oreo    75     Malad
3   Alex    84  Dombivli
4   Fake    82  Ghansoli

In [6]:
# we can manipulate the head() by providing the custom input in parameter.
df.head(2)

    name  mark      city
0    Jon    80    Mumbai
1  Kevin    78  Banglore

In [7]:
df.tail() # Display only bottom 5 enteries in the table.

    name  mark      city
0    Jon    80    Mumbai
1  Kevin    78  Banglore
2   Oreo    75     Malad
3   Alex    84  Dombivli
4   Fake    82  Ghansoli

In [8]:
# we can manipulate the tail() by providing the custom input in parameter.
df.tail(2)

   name  mark      city
3  Alex    84  Dombivli
4  Fake    82  Ghansoli

In [9]:
df_no_index = pd.DataFrame(dict1, index=['A','B','C','D','E'])

In [10]:
df_no_index

    name  mark      city
A    Jon    80    Mumbai
B  Kevin    78  Banglore
C   Oreo    75     Malad
D   Alex    84  Dombivli
E   Fake    82  Ghansoli

### For creating the Series we have to follow below syntax.
    pd.Series([Values])
    
    For provind the index name and single column name we shoud follow the below syntax.
    
    pd.Series([Values], index = ['0','2',...], name='XYZ')
    
    Values - Number of enteries
    index - provide id to enteries
    name - We can create the column name

### Note:
    Actually, DataFrame is just a bunch of Series.

### Example:

In [11]:
ser = pd.Series(['Male','Male','Female','Male','Female'])
ser

0      Male
1      Male
2    Female
3      Male
4    Female
dtype: object

In [12]:
# Now we will provide the column name to above series
ser = pd.Series(ser, name='Gender')

In [13]:
ser

0      Male
1      Male
2    Female
3      Male
4    Female
Name: Gender, dtype: object

In [15]:
# Add above series in df_no_index DataFrame
df_no_index[ser.name] = ser.values

In [17]:
df_no_index

    name  mark      city  Gender
A    Jon    80    Mumbai    Male
B  Kevin    78  Banglore    Male
C   Oreo    75     Malad  Female
D   Alex    84  Dombivli    Male
E   Fake    82  Ghansoli  Female

## Writing or Export Dataframe 

### Syntax for writing DataFrame:
    w = pd.DataFrame({'Key':'Values'})
    w.to_csv("filename.csv")

### Example

In [18]:
df_no_index.to_csv('Dataset/result.csv') #export above data into .csv file

In [19]:
df_no_index.to_csv('Dataset/result_no_index.csv', index=False) #export above data into .csv file without index

## Reading DataFrame

### Syntax
    w = pd.DataFrame({'Key':'Values'})
    w.read_csv("filename.csv")

### Note:
    We can use "Shape" attribbute to check how large DataFrame is.
    If we wanted to pick automatically index from existing file index, we have to use "index_col" parameter.

In [20]:
read = pd.read_csv('Dataset/result.csv')
read

  Unnamed: 0   name  mark      city  Gender
0          A    Jon    80    Mumbai    Male
1          B  Kevin    78  Banglore    Male
2          C   Oreo    75     Malad  Female
3          D   Alex    84  Dombivli    Male
4          E   Fake    82  Ghansoli  Female

In [21]:
#If we wanted to pick automatically index from existing file index, we have to use "index_col" parameter.
read = pd.read_csv('Dataset/result.csv', index_col = 0)
read

    name  mark      city  Gender
A    Jon    80    Mumbai    Male
B  Kevin    78  Banglore    Male
C   Oreo    75     Malad  Female
D   Alex    84  Dombivli    Male
E   Fake    82  Ghansoli  Female

In [22]:
#We can use "Shape" attribbute to check how large DataFrame is
read.shape

(5, 4)

#### We can see the above DataFrame contain 5 rows and 4 columns